thristram/Seraph-SC/STM8S_I2C_Master/src/uart.c
/**
  ******************************************************************************
  * @file    uart.c
  * @author  Seraph
  * @version  V1.0
  * @date     2017-03
  * @brief   This file contains the main function for STM8S003F3 timer operation.
**/


#define  _UART_GLOBAL
#include "stm8s.h"
#include "uart.h"
#include "stdlib.h"

/****************************************************************/
//延时函数delay()，有形参Count用于控制延时函数执行次数，无返回值
/****************************************************************/
void delay(u16 Count)
{
  u8 i,j;
  while (Count--)//Count形参控制延时次数
  {
    for(i=0;i<100;i++)
    for(j=0;j<50;j++);
  }
}

/**
  * @brief  产生随机数 1~255
  * @param  None.
  * @retval None
  */
u8 random(u8 xxx)  
{  
  u8 value,iii;  
  for(iii=0;iii<xxx;iii++)  
  {  
    value = rand() % (MAX + 1- MIN) + MIN; //获取一个随机数1~255
	}  
  return value;  
} 


/**
  * @brief  initializion for uart1
  * @param  None.
  * @retval None
  */
void Init_UART1(void)
{
	UART1_DeInit();
	//波特率115200，8位数据位，1位停止位，无校验位，禁用同步模式，允许接收和发送
	UART1_Init((u32)57600,UART1_WORDLENGTH_8D,UART1_STOPBITS_1,UART1_PARITY_NO,UART1_SYNCMODE_CLOCK_DISABLE,	UART1_MODE_TXRX_ENABLE);
	UART1_ITConfig(UART1_IT_TC,ENABLE);//发送完成中断
	UART1_ITConfig(UART1_IT_RXNE_OR,ENABLE);//接收非空中断
	UART1_Cmd(ENABLE);//启用uart1接口
}


/**
  * @brief  uart1 send data init
  * @param  none.
  * @retval None
  */
void UART1_Send_Data_Init(void)
{
	send_buf[0] = 0xAA;
	send_buf[1] = 0xAA;
	send_buf[2] = 0x11;
	send_buf[3] = 0x22;
	send_buf[4] = 13;	//帧头及校验码不计入内
	send_buf[5] = 0x01;
	send_buf[6] = 0x02;
	send_buf[7] = 0x03;
	send_buf[8] = 0x04;
	send_buf[9] = 0x05;
	send_buf[10] = 0x06;
	send_buf[11] = 0x07;
	send_buf[12] = 0x08;
	send_buf[13] = 0x09;
	send_buf[14] = 0x0A;
	send_buf[15] = Check_Sum(send_buf,15);
	
}

/**
  * @brief  uart1 send data start
  * @param  none.
  * @retval None
  */
void UART1_Send_Data_Start(void)
{
	UART1->DR = send_buf[0];
	send_count = 1;
}


void clear_sicp_buf(void)
{
	u8 i;
	for (i=0;i<30;i++)
	{
		sicp_buf[i] = 0;
	}
}


void clear_send_buf(void)
{
	u8 i;
	for (i=0;i<30;i++)
	{
		send_buf[i] = 0;
	}
}


/**
  * @brief  UART1 tx isr
  * @param  none.
  * @retval None
  */
@interrupt void UART1_TX_ISR(void)
{
	/* In order to detect unexpected events during development,
     it is recommended to set a breakpoint on the following instruction.
  */
	UART1->SR &= ~0x40;//清除发送完成标志位
	if (send_count < send_buf[5]+3)
	{
		UART1->DR = send_buf[send_count];
		send_count++;
	}
	else//发送完成
	{
		send_count = 0;
		rev_count = 0;
	}
}

/**
  * @brief  UART1 rx isr
  * @param  none.
  * @retval None
  */

@interrupt void UART1_RX_ISR(void)
{
	rev_deal();
}


/**
  * @brief  check sum(cumulative sum)
  * @param  u8 *sendbuf,u8 length.
  * @retval u8 result
  */
u8 Check_Sum(u8 *buf,u8 length)
{
	u8 i;
	u8 result = *buf++;
	for(i = 1;i < length;i++)
	{
		result ^= *buf++;
	}
	return result;
}

/**
  * @brief  receive data deal
  * @param  none
  * @retval none
  */
void rev_deal(void)
{
	u8 temp,temp2,i;
	u8 check_sum;
	temp = (u8)UART1->DR;
	rev_buf[rev_count] = temp;
	rev_count++;
	switch(rev_count)
	{
		case 1:
			if ((temp != 0xEE) && (temp != 0xDD))	rev_count = 0;
			break;
		case 2:
			if ((temp != 0xEE) && (temp != 0xDD)) rev_count = 0;
			break;
		case 3:
			//if (!temp)				rev_count = 0;
			break;
		case 4:
			//if (!temp)				rev_count = 0;
			break;
		case 5:
			//if (!temp)				rev_count = 0;
			break;
		default:
			if (rev_count > 30)//防止接收错误后溢出
			{
				rev_count = 0;
			}
			if ((rev_buf[0] == 0xEE)&&(rev_buf[1] == 0xEE))
			{
				if (rev_count > rev_buf[5] + 2)//接收数据完成
				{
					rev_count = 0;
					check_sum = Check_Sum(rev_buf,rev_buf[5] + 2);
					
					if (check_sum == rev_buf[rev_buf[5] + 2])//校验正确	
					{
						rev_success = 1;
						for (i = 0;i < 30;i++)
						{
							sicp_buf[i] = rev_buf[i];
						}
					}
					else
					{
						rev_count = 0;
					}
				}
			}
			else if((rev_buf[0] == 0xDD)&&(rev_buf[1] == 0xDD))
			{
				if (rev_count > rev_buf[3] + 1)//接收数据完成
				{
					rev_count = 0;
					rev_success = 1;
					for (i = 0;i < 30;i++)
					{
						sicp_buf[i] = rev_buf[i];
					}
				}
			}
			else
			{
				rev_count = 0;
			}
			break;
	}
	if (UART1->SR & 0x20) //|| (UART1->SR & UART1_SR_OR))
	{
		temp2 = UART1->DR;
	}	
		/*
		if( UART1_GetITStatus(UART1_IT_RXNE) == SET)
		{
			temp2 = UART1_ReceiveData8();
		}
	
	if(UART1->SR & UART1_SR_OR)
	{
		UART1_ClearITPendingBit(UART1_IT_OR);
	}	
	*/
} 
/**
  * @brief  send_header_init 
	* @param  none
  * @retval none
  */
void send_header_payload_init(u8 id,u8 mesh_id_H,u8 mesh_id_L,u8 len ,u8 cmd)
{
	send_buf[0] = 0xEE;
	send_buf[1] = 0xEE;
	send_buf[2] = id;
	send_buf[3] = mesh_id_H;
	send_buf[4] = mesh_id_L;
	send_buf[5] = len;
	
	switch(cmd)
	{
		case 0x20://回复环境光和环境颜色
			send_buf[6] = cmd;
			send_buf[7] = st1.st_ambient_light;
			send_buf[8] = st1.st_color_sense_L;
			send_buf[9] = st1.st_color_sense_M;
			send_buf[10] = st1.st_color_sense_H;
			break;
		case 0x06://回复心跳包，回复背光LED,及3个触控开关的状态
			send_buf[6] = cmd;
			send_buf[7] = 0x00;//ST Module ID发0x00
			send_buf[8] = 0x00;
			if ((st1.st_device_status & 0x08)==0x08)	send_buf[8] = st1.st_pad1_status;
			send_buf[9] = 0x00;
			if ((st1.st_device_status & 0x04)==0x04)	send_buf[9] = st1.st_pad2_status;
			send_buf[10] = 0x00;
			if ((st1.st_device_status & 0x02)==0x02)	send_buf[10]= st1.st_pad3_status;
			send_buf[11] = 0x00;
			if ((st1.st_device_status & 0x01)==0x01)	send_buf[11]= st1.st_led_status;
			break;
		case 0x29://ST上报手势信息
			send_buf[6] = cmd;
			send_buf[7] = st1.st_ges_H;
			send_buf[8] = st1.st_ges_L;
			send_buf[9] = 0x00;//ST Module ID 保留
			break;
		case 0x35:
			send_buf[6] = cmd;
			if (st_pad1_ctrl)
			{
				send_buf[7] = st1.st_pad1_ctrl_boardid;
				send_buf[8] = st1.st_pad1_status;
			}
			else if (st_pad2_ctrl)
			{
				send_buf[7] = st1.st_pad2_ctrl_boardid;
				send_buf[8] = st1.st_pad2_status;
			}
			else if (st_pad3_ctrl)
			{
				send_buf[7] = st1.st_pad3_ctrl_boardid;
				send_buf[8] = st1.st_pad3_status;
			}
			break;
		case 0xAA://发送回执
		  if (action_ctrlpad_flag)
			{
				action_ctrlpad_flag = 0;
				send_buf[6] = cmd;
				send_buf[7] = 0x05;//代表成功执行并返回模块状态
				send_buf[8] = st1.st_pad1_status;
				send_buf[9] = st1.st_pad2_status;
				send_buf[10] = st1.st_pad3_status;
				send_buf[11] = st1.st_led_status;
			}
			else if(led_ctrl_flag)
			{
				led_ctrl_flag = 0;
				send_buf[6] = cmd;
				send_buf[7] = 0x01;//代表指令执行成功
				if((st1.st_led_mode == 0x4F) ||	(st1.st_led_mode == 0x5F))
					send_buf[7] = 0x02;//代表成功接收数据
			}
			else if(load_alert_flag)
			{
				load_alert_flag = 0;
				send_buf[6] = cmd;
				send_buf[7] = 0x01;//代表指令执行成功
			}
			else if (cmd_refresh_flag)
			{
				cmd_refresh_flag = 0;
				send_buf[6] = cmd;
				send_buf[7] = 0x01;//代表指令执行成功
			}
			else if(receipt_conf_pad1)
			{
				receipt_conf_pad1 = 0;
				send_buf[6] = cmd;
				send_buf[7] = 0x01;//代表指令执行成功
			}
			else if(receipt_conf_pad2)
			{
				receipt_conf_pad2 = 0;
				send_buf[6] = cmd;
				send_buf[7] = 0x03;//代表指令执行失败
			}
			else if(receipt_conf_gest1)
			{
				receipt_conf_gest1 = 0;
				send_buf[6] = cmd;
				send_buf[7] = 0x01;//代表指令执行成功
			}
			else if(receipt_conf_gest2)
			{
				receipt_conf_gest2 = 0;
				send_buf[6] = cmd;
				send_buf[7] = 0x03;//代表指令执行失败
			}
			else if(receipt_device_info2)
			{
				receipt_device_info2 = 0;
				send_buf[6] = cmd;
				send_buf[7] = 0x03;//代表指令执行失败
			}
			break;
		case 0xB4://ST回复设备信息
			send_buf[6] = cmd;
			send_buf[7] = 0x11;//UUID
			send_buf[8] = 0x11;
			send_buf[9] = 0x11;
			send_buf[10] = 0x11;
			send_buf[11] = 0x63;//设备型号
			send_buf[12] = 0x00;//固件版本
			send_buf[13] = st1.st_device_status;
			break;
		case 0x0A://汇报 Seraph相关设备故障 
			send_buf[6] = cmd;
			send_buf[7] = 0xB4;
			send_buf[8] = st1.st_device_status;
			break;
		case 0x51://ST被触发判断需要向SC 发送指令	预设值指令手势
			send_buf[6] = cmd;
			if(gest1_confirm)
			{
				send_buf[7] = st1.st_ges1_ctrl_boardid;
				send_buf[8] = st1.st_ges1_ctrl_action_value;
				send_buf[9] = 0x00;
			}
			else if(gest2_confirm)
			{
				send_buf[7] = st1.st_ges2_ctrl_boardid;
				send_buf[8] = st1.st_ges2_ctrl_action_value;
				send_buf[9] = 0x00;
			}
			else if(gest3_confirm)
			{
				send_buf[7] = st1.st_ges3_ctrl_boardid;
				send_buf[8] = st1.st_ges3_ctrl_action_value;
				send_buf[9] = 0x00;
			}
			else if(gest4_confirm)
			{
				send_buf[7] = st1.st_ges4_ctrl_boardid;
				send_buf[8] = st1.st_ges4_ctrl_action_value;
				send_buf[9] = 0x00;
			}
			else if(st_pad1_confirm)
			{
				send_buf[7] = st1.st_pad1_ctrl_boardid;
				send_buf[8] = 0x00;
				send_buf[9] = 0x00;
			}
			else if(st_pad2_confirm)
			{
				send_buf[7] = st1.st_pad2_ctrl_boardid;
				send_buf[8] = 0x00;
				send_buf[9] = 0x00;
			}
			else if(st_pad3_confirm)
			{
				send_buf[7] = st1.st_pad3_ctrl_boardid;
				send_buf[8] = 0x00;
				send_buf[9] = 0x00;
			}
			
			break;
		case 0x08://ST被触发异步向 SS 推送触发器数值和判断结果
			send_buf[6] = cmd;
			
			if(gest1_confirm)
			{
				send_buf[7] = 0x02;//触发器是手势
				send_buf[8] = st1.st_ges1_ctrl_H;
				send_buf[9] = st1.st_ges1_ctrl_L;
				send_buf[10] = st1.st_ges1_ctrl_meshid_H;
				send_buf[11] = st1.st_ges1_ctrl_meshid_L;
				send_buf[12] = st1.st_ges1_ctrl_action;
				send_buf[13] = st1.st_ges1_ctrl_boardid;
				send_buf[14] = st1.st_ges1_ctrl_action_value;
				send_buf[15] = st1.st_ges1_ctrl_action_time;
			}
			else if(gest2_confirm)
			{
				send_buf[7] = 0x02;
				send_buf[8] = st1.st_ges2_ctrl_H;
				send_buf[9] = st1.st_ges2_ctrl_L;
				send_buf[10] = st1.st_ges2_ctrl_meshid_H;
				send_buf[11] = st1.st_ges2_ctrl_meshid_L;
				send_buf[12] = st1.st_ges2_ctrl_action;
				send_buf[13] = st1.st_ges2_ctrl_boardid;
				send_buf[14] = st1.st_ges2_ctrl_action_value;
				send_buf[15] = st1.st_ges2_ctrl_action_time;
			}
			else if(gest3_confirm)
			{
				send_buf[7] = 0x02;
				send_buf[8] = st1.st_ges3_ctrl_H;
				send_buf[9] = st1.st_ges3_ctrl_L;
				send_buf[10] = st1.st_ges3_ctrl_meshid_H;
				send_buf[11] = st1.st_ges3_ctrl_meshid_L;
				send_buf[12] = st1.st_ges3_ctrl_action;
				send_buf[13] = st1.st_ges3_ctrl_boardid;
				send_buf[14] = st1.st_ges3_ctrl_action_value;
				send_buf[15] = st1.st_ges3_ctrl_action_time;
			}
			else if(gest4_confirm)
			{
				send_buf[7] = 0x02;
				send_buf[8] = st1.st_ges4_ctrl_H;
				send_buf[9] = st1.st_ges4_ctrl_L;
				send_buf[10] = st1.st_ges4_ctrl_meshid_H;
				send_buf[11] = st1.st_ges4_ctrl_meshid_L;
				send_buf[12] = st1.st_ges4_ctrl_action;
				send_buf[13] = st1.st_ges4_ctrl_boardid;
				send_buf[14] = st1.st_ges4_ctrl_action_value;
				send_buf[15] = 0x00;
			}
			else if(st_pad1_confirm)
			{
				send_buf[7] = 0x01;//触发器是按键
				send_buf[8] = 0x00;
				send_buf[9] = st1.st_ctrl_address;
				send_buf[10] = st1.st_pad1_ctrl_meshid_H;
				send_buf[11] = st1.st_pad1_ctrl_meshid_L;
				send_buf[12] = st1.st_pad1_ctrl_action;
				send_buf[13] = st1.st_pad1_ctrl_boardid;
				send_buf[14] = 0x00;
				send_buf[15] = 0x00;
			}
			else if(st_pad2_confirm)
			{
				send_buf[7] = 0x01;//触发器是按键
				send_buf[8] = 0x00;
				send_buf[9] = st1.st_ctrl_address;
				send_buf[10] = st1.st_pad2_ctrl_meshid_H;
				send_buf[11] = st1.st_pad2_ctrl_meshid_L;
				send_buf[12] = st1.st_pad2_ctrl_action;
				send_buf[13] = st1.st_pad2_ctrl_boardid;
				send_buf[14] = 0x00;
				send_buf[15] = 0x00;
			}
			else if(st_pad3_confirm)
			{
				send_buf[7] = 0x01;//触发器是按键
				send_buf[8] = 0x00;
				send_buf[9] = st1.st_ctrl_address;
				send_buf[10] = st1.st_pad3_ctrl_meshid_H;
				send_buf[11] = st1.st_pad3_ctrl_meshid_L;
				send_buf[12] = st1.st_pad3_ctrl_action;
				send_buf[13] = st1.st_pad3_ctrl_boardid;
				send_buf[14] = 0x00;
				send_buf[15] = 0x00;
			}
			break;
	}
	send_buf[len+2] = Check_Sum((send_buf+2),len);
}

/**
  * @brief  send_payload_init 
	* @param  none
  * @retval none
  */
/*
void send_payload_init(u8 len,u8 cmd)
{
	
