thristram/Seraph-SC/STM8S_I2C_Master/src/uart.c
}
*/
/**
  * @brief  rev_header_anaylze
	* @param  none
  * @retval none
  */
void rev_header_anaylze(u8 *message_id,u8 *mesh_id_H,u8 *mesh_id_L,u8 *message_length)
{
	if ((sicp_buf[0] == 0xEE) && (sicp_buf[1]== 0xEE))
	{
		ble_data_frame = 1;
		*message_id = sicp_buf[2];
		*mesh_id_H = sicp_buf[3];
		*mesh_id_L = sicp_buf[4];
		*message_length = sicp_buf[5];
		//return TRUE;
	}
	else if ((sicp_buf[0] == 0xDD) && (sicp_buf[1]== 0xDD))//Network	Status	Reporting	
	{
		ble_ctrl_frame = 1;
		*message_length = sicp_buf[3];
		//return TRUE;
	}
	//else
	//{
	//	return FALSE;
	//}
}

/**
  * @brief  rev_payload_anaylze
	* @param  none
  * @retval none
  */
bool rev_payload_anaylze(void)
{

	if (ble_data_frame)
	{
		ble_data_frame = 0;
		switch(sicp_buf[6])
		{
			case 0x04://SS向ST发送配置信息
				receipt_device_info1 = 1;
				//if (sicp_buf[2] == device_info_message_id)
				{
					if (sicp_buf[7] == 0x01)//设置ST按键作用
					{
						kickout_flag = 0;
						net_reset_flag = 0;
						if ((sicp_buf[8] & 0x01) == 0x01)//设置通道1
						{
							st1.st_pad1_ctrl_meshid_H = sicp_buf[10];
							st1.st_pad1_ctrl_meshid_L = sicp_buf[11];
							st1.st_pad1_ctrl_boardid 	= sicp_buf[12];
							st1.st_pad1_ctrl_action   = sicp_buf[13];
							st1.st_pad1_ctrl_action_value = sicp_buf[14];
							receipt_conf_pad1 = 1;
							send_message_length = 6;
							send_cmd = 0xAA;
							send_header_payload_init(rev_message_id,ns_own_meshid_H,ns_own_meshid_L,send_message_length,send_cmd);
							UART1_Send_Data_Start();
							break;
						}
						else if ((sicp_buf[8] & 0x02) == 0x02)//设置通道2
						{
							st1.st_pad2_ctrl_meshid_H = sicp_buf[10];
							st1.st_pad2_ctrl_meshid_L = sicp_buf[11];
							st1.st_pad2_ctrl_boardid 	= sicp_buf[12];
							st1.st_pad2_ctrl_action   = sicp_buf[13];
							st1.st_pad2_ctrl_action_value = sicp_buf[14];
							receipt_conf_pad1 = 1;
							send_message_length = 6;
							send_cmd = 0xAA;
							send_header_payload_init(rev_message_id,ns_own_meshid_H,ns_own_meshid_L,send_message_length,send_cmd);
							UART1_Send_Data_Start();
							break;
						}
						else if ((sicp_buf[8] & 0x04) == 0x04)//设置通道3
						{
							st1.st_pad3_ctrl_meshid_H = sicp_buf[10];
							st1.st_pad3_ctrl_meshid_L = sicp_buf[11];
							st1.st_pad3_ctrl_boardid 	= sicp_buf[12];
							st1.st_pad3_ctrl_action   = sicp_buf[13];
							st1.st_pad3_ctrl_action_value = sicp_buf[14];
							receipt_conf_pad1 = 1;
							send_message_length = 6;
							send_cmd = 0xAA;
							send_header_payload_init(rev_message_id,ns_own_meshid_H,ns_own_meshid_L,send_message_length,send_cmd);
							UART1_Send_Data_Start();
							break;
						}
						else
						{
							receipt_conf_pad2 = 1;
							send_message_length = 6;
							send_cmd = 0xAA;
							send_header_payload_init(rev_message_id,ns_own_meshid_H,ns_own_meshid_L,send_message_length,send_cmd);
							UART1_Send_Data_Start();
							break;
						}
						
					}
					if (sicp_buf[7] == 0x02)//设置ST手势作用
					{
						kickout_flag = 0;
						net_reset_flag = 0;
						
						if((sicp_buf[8] != st1.st_ges1_ctrl_H) && (sicp_buf[9] != st1.st_ges1_ctrl_L))//第一个预设置手势
						{
							st1.st_ges1_ctrl_H						= sicp_buf[8];
							st1.st_ges1_ctrl_L						= sicp_buf[9];
							st1.st_ges1_ctrl_meshid_H 		= sicp_buf[10];
							st1.st_ges1_ctrl_meshid_L 		= sicp_buf[11];
							st1.st_ges1_ctrl_boardid 			= sicp_buf[12];
							st1.st_ges1_ctrl_action				= sicp_buf[13];
							st1.st_ges1_ctrl_action_value = sicp_buf[14];
							receipt_conf_gest1 = 1;
							send_message_length = 6;
							send_cmd = 0xAA;
							send_header_payload_init(rev_message_id,ns_own_meshid_H,ns_own_meshid_L,send_message_length,send_cmd);
							UART1_Send_Data_Start();
							break;
						}
						else if((sicp_buf[8] != st1.st_ges2_ctrl_H) && (sicp_buf[9] != st1.st_ges2_ctrl_L))//第二个预设置手势
						{
							st1.st_ges2_ctrl_H						= sicp_buf[8];
							st1.st_ges2_ctrl_L						= sicp_buf[9];
							st1.st_ges2_ctrl_meshid_H 		= sicp_buf[10];
							st1.st_ges2_ctrl_meshid_L 		= sicp_buf[11];
							st1.st_ges2_ctrl_boardid 			= sicp_buf[12];
							st1.st_ges2_ctrl_action				= sicp_buf[13];
							st1.st_ges2_ctrl_action_value = sicp_buf[14];
							receipt_conf_gest1 = 1;
							send_message_length = 6;
							send_cmd = 0xAA;
							send_header_payload_init(rev_message_id,ns_own_meshid_H,ns_own_meshid_L,send_message_length,send_cmd);
							UART1_Send_Data_Start();
							break;
						}
						else if((sicp_buf[8] != st1.st_ges3_ctrl_H) && (sicp_buf[9] != st1.st_ges3_ctrl_L))//第三个预设置手势
						{
							st1.st_ges3_ctrl_H						= sicp_buf[8];
							st1.st_ges3_ctrl_L						= sicp_buf[9];
							st1.st_ges3_ctrl_meshid_H 		= sicp_buf[10];
							st1.st_ges3_ctrl_meshid_L 		= sicp_buf[11];
							st1.st_ges3_ctrl_boardid 			= sicp_buf[12];
							st1.st_ges3_ctrl_action				= sicp_buf[13];
							st1.st_ges3_ctrl_action_value = sicp_buf[14];
							receipt_conf_gest1 = 1;
							send_message_length = 6;
							send_cmd = 0xAA;
							send_header_payload_init(rev_message_id,ns_own_meshid_H,ns_own_meshid_L,send_message_length,send_cmd);
							UART1_Send_Data_Start();
							break;
						}
						else if((sicp_buf[8] != st1.st_ges4_ctrl_H) && (sicp_buf[9] != st1.st_ges4_ctrl_L))//第三个预设置手势
						{
							st1.st_ges4_ctrl_H						= sicp_buf[8];
							st1.st_ges4_ctrl_L						= sicp_buf[9];
							st1.st_ges4_ctrl_meshid_H 		= sicp_buf[10];
							st1.st_ges4_ctrl_meshid_L 		= sicp_buf[11];
							st1.st_ges4_ctrl_boardid 			= sicp_buf[12];
							st1.st_ges4_ctrl_action				= sicp_buf[13];
							st1.st_ges4_ctrl_action_value = sicp_buf[14];
							receipt_conf_gest1 = 1;
							send_message_length = 6;
							send_cmd = 0xAA;
							send_header_payload_init(rev_message_id,ns_own_meshid_H,ns_own_meshid_L,send_message_length,send_cmd);
							UART1_Send_Data_Start();
							break;
						}
						else if(((sicp_buf[8] == st1.st_ges1_ctrl_H) && (sicp_buf[9] == st1.st_ges1_ctrl_L))
										|| ((sicp_buf[8] == st1.st_ges2_ctrl_H) && (sicp_buf[9] == st1.st_ges2_ctrl_L))
										|| ((sicp_buf[8] == st1.st_ges3_ctrl_H) && (sicp_buf[9] == st1.st_ges3_ctrl_L))
										|| ((sicp_buf[8] == st1.st_ges3_ctrl_H) && (sicp_buf[9] == st1.st_ges3_ctrl_L)))
						{
							receipt_conf_gest1 = 1;
							send_message_length = 6;
							send_cmd = 0xAA;
							send_header_payload_init(rev_message_id,ns_own_meshid_H,ns_own_meshid_L,send_message_length,send_cmd);
							UART1_Send_Data_Start();
							break;
						}
						else
						{
							receipt_conf_gest2 = 1;
							send_message_length = 6;
							send_cmd = 0xAA;
							send_header_payload_init(rev_message_id,ns_own_meshid_H,ns_own_meshid_L,send_message_length,send_cmd);
							UART1_Send_Data_Start();
							break;
						}
					}
				}
				break;
			case 0xAA://SS回复ST的Device Info，Kick Out踢出
				if (sicp_buf[7] == 0x04)
				{
					kickout_flag = 1;
				}
				break;
				if(sicp_buf[7] == 0x07)//SS/SC回复ST丢包，置位receipt_send_failed
				{
					receipt_send_failed = 1;
					
