thristram/Seraph-SC/STM8S_I2C_Master/src/uart.c
				}
				break;
			case 0xC0://BLE 网络模块重置指令
				if (sicp_buf[7] == 0x02)
				{
					net_reset_flag = 1;
				}
				break;
			case 0x03://CMD-Data 
				if (sicp_buf[7] == 0x02)//刷新SC传感器数据
				{
					cmd_refresh_flag = 1;
					send_message_length = 6;
					send_cmd = 0xAA;
					send_header_payload_init(rev_message_id,ns_own_meshid_H,ns_own_meshid_L,send_message_length,send_cmd);
					UART1_Send_Data_Start();
				}
				if (sicp_buf[7] == 0x03)//汇报当前设备状态信息
				{
					cmd_status_flag = 1;
					rev_module_id = sicp_buf[8];
					send_message_length = 10;
					send_cmd = 0x06;
					send_header_payload_init(rev_message_id,ns_own_meshid_H,ns_own_meshid_L,send_message_length,send_cmd);
					UART1_Send_Data_Start();
				}
				break;
			case 0x56://打开或关闭ST开关
				action_ctrlpad_flag = 1;
				st1.st_ctrl_address = sicp_buf[7];
				if((sicp_buf[7] & 0x01) == 0x01)
					st_pad1_ctrl = 1;
				if((sicp_buf[7] & 0x02) == 0x02)
					st_pad2_ctrl = 1;
				if((sicp_buf[7] & 0x04) == 0x04)
					st_pad3_ctrl = 1;
				if((sicp_buf[7] & 0x08) == 0x08)
					st_led_ctrl = 1;
				st1.st_ctrl_value  = sicp_buf[8];
				send_message_length = 10;
				send_cmd = 0xAA;
				send_header_payload_init(rev_message_id,ns_own_meshid_H,ns_own_meshid_L,send_message_length,send_cmd);
				//send_payload_init(send_message_length,send_cmd);
				UART1_Send_Data_Start();
				break;
			case 0x09://LED控制
				led_ctrl_flag = 1;
				switch(sicp_buf[7])
				{
					case 0x1F://循环模式
						st1.st_led_mode = 0x1F;
						st1.st_led_density = sicp_buf[8];
						st1.st_led_speed = sicp_buf[9];
						st1.st_led_color1_H = sicp_buf[10];
						st1.st_led_color1_M = sicp_buf[11];
						st1.st_led_color1_L = sicp_buf[12];
						st1.st_led_color2_H = sicp_buf[13];
						st1.st_led_color2_M = sicp_buf[14];
						st1.st_led_color2_L = sicp_buf[15];
						send_message_length = 6;
						send_cmd = 0xAA;
						send_header_payload_init(rev_message_id,ns_own_meshid_H,ns_own_meshid_L,send_message_length,send_cmd);
						//send_payload_init(send_message_length,send_cmd);
						UART1_Send_Data_Start();
						break;
					case 0x2F://呼吸灯模式
						st1.st_led_mode = 0x2F;
						st1.st_led_in		= sicp_buf[8];
						st1.st_led_duration = sicp_buf[9];
						st1.st_led_out	= sicp_buf[10];
						st1.st_led_blank = sicp_buf[11];
						st1.st_led_color1_H = sicp_buf[12];
						st1.st_led_color1_M = sicp_buf[13];
						st1.st_led_color1_L = sicp_buf[14];
						st1.st_led_color2_H = sicp_buf[15];
						st1.st_led_color2_M = sicp_buf[16];
						st1.st_led_color2_L = sicp_buf[17];
						send_message_length = 6;
						send_cmd = 0xAA;
						send_header_payload_init(rev_message_id,ns_own_meshid_H,ns_own_meshid_L,send_message_length,send_cmd);
						//send_payload_init(send_message_length,send_cmd);
						UART1_Send_Data_Start();
						break;
					case 0x3F://颜色变化模式，从一个主颜色渐变黑色再变到另一个主颜色
						st1.st_led_mode = 0x3F;
						st1.st_led_in		= sicp_buf[8];
						st1.st_led_duration = sicp_buf[9];
						st1.st_led_color1_H = sicp_buf[10];
						st1.st_led_color1_M = sicp_buf[11];
						st1.st_led_color1_L = sicp_buf[12];
						st1.st_led_color2_H = sicp_buf[13];
						st1.st_led_color2_M = sicp_buf[14];
						st1.st_led_color2_L = sicp_buf[15];
						send_message_length = 6;
						send_cmd = 0xAA;
						send_header_payload_init(rev_message_id,ns_own_meshid_H,ns_own_meshid_L,send_message_length,send_cmd);
						//send_payload_init(send_message_length,send_cmd);
						UART1_Send_Data_Start();
						break;
					case 0x4F://指示灯模式，把LED的显示权交给设备
						st1.st_led_mode = 0x4F;
						send_message_length = 6;
						send_cmd = 0xAA;
						send_header_payload_init(rev_message_id,ns_own_meshid_H,ns_own_meshid_L,send_message_length,send_cmd);
						//send_payload_init(send_message_length,send_cmd);
						UART1_Send_Data_Start();
						break;
					case 0x5F://关闭模式。关闭所有LED显示 
						st1.st_led_mode = 0x5F;
						send_message_length = 6;
						send_cmd = 0xAA;
						send_header_payload_init(rev_message_id,ns_own_meshid_H,ns_own_meshid_L,send_message_length,send_cmd);
						//send_payload_init(send_message_length,send_cmd);
						UART1_Send_Data_Start();
						break;
				}
				break;
			case 0x05://用于加载预装的报警信息，若此方法激活，则忽略所有 LED方法
				load_alert_flag = 1;
				st1.st_load_alert = sicp_buf[7];
				send_message_length = 6;
				send_cmd = 0xAA;
				send_header_payload_init(rev_message_id,ns_own_meshid_H,ns_own_meshid_L,send_message_length,send_cmd);
				//send_payload_init(send_message_length,send_cmd);
				UART1_Send_Data_Start();
				break;
			default:
				break;
		}
		
		return TRUE;
	}
	else if (ble_ctrl_frame)
	{
		ble_ctrl_frame = 0;
		switch(sicp_buf[4])
		{
			case 0x01://网络状态帧
				ns_signal = sicp_buf[5];
				ns_status = sicp_buf[6];
				ns_phonenum = sicp_buf[7];
				ns_own_meshid_H = sicp_buf[8];
				ns_own_meshid_L = sicp_buf[9];
				ns_host_meshid_H = sicp_buf[10];
				ns_host_meshid_L = sicp_buf[11];
				break;
			case 0x02://重置芯片，清空串口缓存，保留mesh连接
				break;
			case 0x03://重置芯片和网络，退出mesh连接
				break;
		}
		generate_messageid = 0x86;//for debug
		//generate_messageid = random(TIM4->CNTR);
		device_info_message_id = generate_messageid;
		//已经分配到Mesh ID,且host mesh id不为0Device Info指令发送自己的配置信息
		if ((((u16)(ns_own_meshid_H<<8) + (u16)ns_own_meshid_L) > 0)
			&& (((u16)(ns_host_meshid_H<<8) + (u16)ns_host_meshid_L) > 0))
		{
			if (!receipt_device_info1)
			{
				
				//clear_sicp_buf();
				send_message_length = 12;
				send_cmd = 0xB4;
				send_header_payload_init(device_info_message_id,ns_own_meshid_H,ns_own_meshid_L,send_message_length,send_cmd);
				//send_payload_init(send_message_length,send_cmd);
				UART1_Send_Data_Start();
				delay(10);
			}
		}
		else
		{
			receipt_device_info2 = 1;
			send_message_length = 6;
			send_cmd = 0xAA;
			send_header_payload_init(device_info_message_id,ns_own_meshid_H,ns_own_meshid_L,send_message_length,send_cmd);
			UART1_Send_Data_Start();
			delay(10);
		}
		return TRUE;
	}
	else
	{
		return FALSE;
	}
}

/**
  * @brief  receive data analyze and reply，放入Task1ms()
	* @param  none
  * @retval none
  */
void reve_analyze_reply(void)
{
	if (rev_success)
	{
		rev_success = 0;
		rev_header_anaylze(&rev_message_id,&rev_meshid_H,&rev_meshid_L,&rev_message_length);
		rev_payload_anaylze();
	}
	
	/****************************************************
	以下ST主动发送的数据如果收到AA 07回执需要重新发送一次
	*****************************************************/
	/***********准备下一次重发***********/
	if (receipt_send_failed)
	{
		receipt_send_failed = 0;
		st_pad1_ctrl = st_pad_temp._flag_bit.bit0;
		st_pad2_ctrl = st_pad_temp._flag_bit.bit1;
		st_pad3_ctrl = st_pad_temp._flag_bit.bit2;
		st_pad1_confirm = st_pad_temp._flag_bit.bit3;
		st_pad2_confirm = st_pad_temp._flag_bit.bit4;
		st_pad3_confirm = st_pad_temp._flag_bit.bit5;
	}
	/***********准备下一次重发***********/
	if (receipt_send_failed)
	{
		receipt_send_failed = 0;
		st1.st_ges_H = st1_st_ges_H_temp;
		st1.st_ges_L = st1_st_ges_L_temp;
	}
	
	if (st_pad1_ctrl | st_pad2_ctrl | st_pad3_ctrl)
	{
	//当检测到触摸按键状态改变时，属于预设值按键，发送控制SC指令,并且发送异步通知给SS
		if(st_pad1_confirm | st_pad2_confirm | st_pad3_confirm)
		{
			st_pad_temp._flag_bit.bit0 = st_pad1_ctrl;
			st_pad_temp._flag_bit.bit1 = st_pad2_ctrl;
			st_pad_temp._flag_bit.bit2 = st_pad3_ctrl;
			st_pad_temp._flag_bit.bit3 = st_pad1_confirm;
			st_pad_temp._flag_bit.bit4 = st_pad2_confirm;
			st_pad_temp._flag_bit.bit5 = st_pad3_confirm;
			
				generate_messageid = random(TIM4->CNTR);
				send_message_length = 8;
				send_cmd = 0x51;
				if (st_pad1_confirm)//预设置按键1被触发
				{
					st_pad1_ctrl = 0;
					send_header_payload_init(gesture_noset_message_id,st1.st_pad1_ctrl_meshid_H,st1.st_pad1_ctrl_meshid_L,send_message_length,send_cmd);
				}
				else if (st_pad2_confirm)
				{
					st_pad2_ctrl = 0;
					send_header_payload_init(gesture_noset_message_id,st1.st_pad2_ctrl_meshid_H,st1.st_pad2_ctrl_meshid_L,send_message_length,send_cmd);
				}
				else if (st_pad3_confirm)
				{
					st_pad3_ctrl = 0;
					send_header_payload_init(gesture_noset_message_id,st1.st_pad3_ctrl_meshid_H,st1.st_pad3_ctrl_meshid_L,send_message_length,send_cmd);
				}
				//send_payload_init(send_message_length,send_cmd);
				UART1_Send_Data_Start();
				delay(10);
				
