thristram/Seraph-SC/STM8S_I2C_Master/src/uart.c
				//发送异步通知给SS
				clear_send_buf();
				send_message_length = 14;
				send_cmd = 0x08;
				if (st_pad1_confirm)//预设置按键1被触发
				{
					st_pad1_confirm = 0;
					send_header_payload_init(gesture_noset_message_id,st1.st_pad1_ctrl_meshid_H,st1.st_pad1_ctrl_meshid_L,send_message_length,send_cmd);
				}
				else if (st_pad2_confirm)
				{
					st_pad2_confirm = 0;
					send_header_payload_init(gesture_noset_message_id,st1.st_pad2_ctrl_meshid_H,st1.st_pad2_ctrl_meshid_L,send_message_length,send_cmd);
				}
				else if(st_pad3_confirm)
				{
					st_pad2_confirm = 0;
					send_header_payload_init(gesture_noset_message_id,st1.st_pad3_ctrl_meshid_H,st1.st_pad3_ctrl_meshid_L,send_message_length,send_cmd);
				}
				UART1_Send_Data_Start();
				delay(10);
		}
		else//当检测到触摸按键状态改变时，不属于预设值按键，则通过此指令上报按键
		{
			send_message_length = 7;
			send_cmd = 0x35;
			if (st_pad1_ctrl)
			{
				st_pad1_ctrl = 0;
				send_header_payload_init(gesture_noset_message_id,st1.st_pad1_ctrl_meshid_H,st1.st_pad1_ctrl_meshid_L,send_message_length,send_cmd);
			}
			else if (st_pad2_ctrl)
			{
				st_pad2_ctrl = 0;
				send_header_payload_init(gesture_noset_message_id,st1.st_pad2_ctrl_meshid_H,st1.st_pad2_ctrl_meshid_L,send_message_length,send_cmd);
			}
			else if (st_pad3_ctrl)
			{
				st_pad3_ctrl = 0;
				send_header_payload_init(gesture_noset_message_id,st1.st_pad3_ctrl_meshid_H,st1.st_pad3_ctrl_meshid_L,send_message_length,send_cmd);
			}
			UART1_Send_Data_Start();
			delay(10);
		}
	}
	
	
	
	//当ST检测到改手势不属于预设置的指令触发手势（例如左右左是开灯）。则通过此命令上报手势
	if ((st1.st_ges_H != 0x00) && (st1.st_ges_L != 0x00))
	{
		st1_st_ges_H_temp = st1.st_ges_H;
		st1_st_ges_L_temp = st1.st_ges_L;
		st1.st_ges_H = 0x00;
		st1.st_ges_L = 0x00;
		
		if((!gest1_confirm) && (!gest2_confirm) && (!gest3_confirm) && (!gest4_confirm))
		{	
			receipt_gesture1 = 0;//清除接收到该指令回执
			generate_messageid = random(TIM4->CNTR);
			gesture_noset_message_id = generate_messageid;
			
			send_message_length = 8;
			send_cmd = 0x29;
			send_header_payload_init(gesture_noset_message_id,ns_own_meshid_H,ns_own_meshid_L,send_message_length,send_cmd);
			//send_payload_init(send_message_length,send_cmd);
			UART1_Send_Data_Start();
			delay(10);
		}
		else//检测到手势属于预设值指令触发手势，Asynchronous Action Notification
		{
			receipt_gesture2 = 0;//清除接收到该指令回执
			generate_messageid = random(TIM4->CNTR);
			gesture_set_message_id = generate_messageid;
			send_message_length = 8;
			send_cmd = 0x51;
			if (gest1_confirm)
			{
				send_header_payload_init(gesture_set_message_id,st1.st_ges1_ctrl_meshid_H,st1.st_ges1_ctrl_meshid_L,send_message_length,send_cmd);
			}
			else if (gest2_confirm)
			{
				send_header_payload_init(generate_messageid,st1.st_ges2_ctrl_meshid_H,st1.st_ges2_ctrl_meshid_L,send_message_length,send_cmd);
			}
			else if (gest3_confirm)
			{
				send_header_payload_init(generate_messageid,st1.st_ges3_ctrl_meshid_H,st1.st_ges3_ctrl_meshid_L,send_message_length,send_cmd);
			}
			else if (gest4_confirm)
			{
				send_header_payload_init(generate_messageid,st1.st_ges4_ctrl_meshid_H,st1.st_ges4_ctrl_meshid_L,send_message_length,send_cmd);
			}
			//send_payload_init(send_message_length,send_cmd);
			UART1_Send_Data_Start();
			//short delay 等待数据发送完成，ST异步向 SS 推送触发器数值和判断结果
			delay(10);
			clear_send_buf();
			send_message_length = 14;
			send_cmd = 0x08;
			if (gest1_confirm)
			{
				send_header_payload_init(gesture_set_message_id,st1.st_ges1_ctrl_meshid_H,st1.st_ges1_ctrl_meshid_L,send_message_length,send_cmd);
			}
			else if (gest2_confirm)
			{
				send_header_payload_init(generate_messageid,st1.st_ges2_ctrl_meshid_H,st1.st_ges2_ctrl_meshid_L,send_message_length,send_cmd);
			}
			else if (gest3_confirm)
			{
				send_header_payload_init(generate_messageid,st1.st_ges3_ctrl_meshid_H,st1.st_ges3_ctrl_meshid_L,send_message_length,send_cmd);
			}
			else if (gest4_confirm)
			{
				send_header_payload_init(generate_messageid,st1.st_ges4_ctrl_meshid_H,st1.st_ges4_ctrl_meshid_L,send_message_length,send_cmd);
			}
			//send_payload_init(send_message_length,send_cmd);
			UART1_Send_Data_Start();
			delay(10);
		}
	}
	
	
	//STM8S掉线或其他传感器故障发送Malfunction Command
	if ((st1.st_device_status & 0xFF) < 0xFF)//ST有故障,有0无1
	{
		send_fault_count++;
		if (send_fault_count >= 500)
		{
			send_fault_count = 0;
			generate_messageid = random(TIM4->CNTR);
			send_message_length = 7;
			send_cmd = 0x0A;
			send_header_payload_init(generate_messageid,ns_own_meshid_H,ns_own_meshid_L,send_message_length,send_cmd);
			//send_payload_init(send_message_length,send_cmd);
			UART1_Send_Data_Start();
		}
	}
}